the	1588
a	1065
to	947
of	774
and	599
in	518
that	445
b	396
d	394
is	391
c	388
for	312
it	298
are	251
on	239
s	231
be	220
with	188
you	183
not	174
they	167
their	165
as	161
have	161
more	159
from	151
but	147
at	138
we	132
by	127
or	111
can	110
people	110
your	110
was	107
an	103
about	95
this	95
t	93
has	90
text	80
than	80
i	78
should	75
were	72
there	71
time	70
students	68
which	67
who	67
will	67
work	67
do	64
what	64
answer	63
new	63
our	63
all	62
most	62
when	61
if	60
he	59
may	59
one	58
them	57
so	56
into	55
would	55
points	54
up	53
write	53
many	52
how	50
much	50
following	49
its	49
need	49
out	49
sheet	49
some	49
make	48
directions	47
just	46
less	45
use	45
because	44
part	44
been	43
even	43
other	43
us	43
home	42
according	41
after	41
these	41
says	40
his	39
life	39
often	39
women	39
get	38
had	38
no	38
only	38
paragraph	37
jobs	36
section	36
world	36
year	36
children	35
like	35
such	35
those	35
read	34
said	32
school	32
also	31
could	31
don	31
each	31
over	31
own	31
way	31
american	30
author	30
college	29
reading	29
while	29
years	29
between	28
tears	28
gap	27
good	27
homework	27
still	27
two	27
feel	26
percent	26
states	26
today	26
future	25
give	25
likely	25
mark	25
parents	25
things	25
best	24
first	24
job	24
money	24
power	24
think	24
well	24
where	24
any	23
before	23
both	23
different	23
energy	23
help	23
means	23
public	23
working	23
become	22
government	22
happiness	22
housing	22
my	22
through	22
very	22
art	21
being	21
business	21
economic	21
federal	21
found	21
now	21
re	21
without	21
average	20
companies	20
doesn	20
enough	20
going	20
health	20
instead	20
jury	20
last	20
least	20
lives	20
making	20
off	20
state	20
study	20
take	20
used	20
young	20
back	19
better	19
come	19
day	19
down	19
education	19
family	19
market	19
might	19
outside	19
problem	19
talk	19
then	19
too	19
translation	19
university	19
workers	19
change	18
find	18
great	18
having	18
high	18
know	18
learn	18
social	18
something	18
times	18
toward	18
want	18
believe	17
big	17
conversation	17
countries	17
every	17
history	17
human	17
once	17
research	17
she	17
words	17
writing	17
among	16
attention	16
based	16
does	16
effect	16
end	16
few	16
firms	16
line	16
longer	16
man	16
manufacturing	16
men	16
name	16
others	16
questions	16
rather	16
right	16
society	16
spending	16
themselves	16
though	16
ago	15
answers	15
around	15
away	15
example	15
g	15
her	15
important	15
keep	15
ll	15
newspapers	15
products	15
really	15
recession	15
since	15
word	15
yet	15
against	14
always	14
another	14
balance	14
chart	14
doing	14
emotional	14
employment	14
english	14
everyone	14
fact	14
focus	14
impact	14
information	14
list	14
part-time	14
same	14
see	14
seems	14
system	14
united	14
whether	14
actually	13
americans	13
chinese	13
community	13
corporate	13
crying	13
digital	13
four	13
girls	13
habits	13
hard	13
higher	13
increase	13
kids	13
lack	13
living	13
long	13
numbered	13
para	13
past	13
patents	13
pay	13
place	13
plan	13
policy	13
poor	13
quickly	13
researchers	13
set	13
studies	13
true	13
why	13
almost	12
approach	12
book	12
choose	12
create	12
daily	12
directors	12
e	12
essay	12
facebook	12
firm	12
funds	12
getting	12
go	12
greater	12
growth	12
industry	12
insurance	12
key	12
look	12
lot	12
made	12
me	12
must	12
nearly	12
probably	12
reason	12
try	12
users	12
usually	12
week	12
agree	11
career	11
common	11
competition	11
did	11
easy	11
eu	11
face	11
far	11
him	11
however	11
labor	11
learned	11
little	11
members	11
national	11
person	11
problems	11
professor	11
science	11
stay	11
suggests	11
taking	11
u	11
wind	11
won	11
able	10
address	10
adults	10
age	10
blank	10
cannot	10
choosing	10
comments	10
computer	10
court	10
days	10
economy	10
educational	10
electronic	10
fear	10
fire	10
first-generation	10
groups	10
happy	10
moment	10
move	10
negative	10
never	10
number	10
paper	10
places	10
point	10
political	10
possible	10
recently	10
remember	10
say	10
share	10
sign	10
small	10
spend	10
tend	10
thinking	10
translate	10
under	10
war	10
ways	10
within	10
although	9
america	9
ask	9
attitude	9
bad	9
became	9
becomes	9
behind	9
believes	9
beyond	9
class	9
column	9
culture	9
deep	9
early	9
especially	9
europe	9
extra	9
f	9
food	9
gene	9
generally	9
giants	9
given	9
ii	9
inferred	9
influence	9
kind	9
left	9
letter	9
makes	9
million	9
office	9
perhaps	9
pressure	9
put	9
real	9
remain	9
results	9
role	9
seem	9
several	9
show	9
sports	9
started	9
stress	9
suppose	9
tasks	9
thing	9
three	9
top	9
universities	9
value	9
voluntary	9
academic	8
achievement	8
advance	8
advice	8
asked	8
authors	8
birds	8
board	8
body	8
came	8
carry	8
case	8
century	8
child	8
close	8
compared	8
comprehension	8
consumers	8
course	8
creating	8
department	8
designed	8
efficiency	8
efficient	8
eye	8
factors	8
failed	8
financial	8
focused	8
giving	8
global	8
harder	8
homes	8
hours	8
indeed	8
interpret	8
joe	8
leave	8
link	8
live	8
looking	8
lost	8
meaning	8
mies	8
mind	8
nature	8
needs	8
newspaper	8
next	8
obesity	8
old	8
opportunities	8
particularly	8
personal	8
pink	8
popular	8
positive	8
product	8
rate	8
readers	8
reding	8
report	8
selection	8
service	8
services	8
simply	8
someone	8
sport	8
stop	8
success	8
suitable	8
technology	8
terms	8
tests	8
thought	8
until	8
works	8
above	7
access	7
across	7
advertising	7
associated	7
available	7
books	7
busy	7
buying	7
call	7
cheap	7
choice	7
communication	7
complete	7
concept	7
concerned	7
considered	7
curiosity	7
customers	7
data	7
deal	7
decline	7
defined	7
design	7
desperate	7
details	7
development	7
didn	7
done	7
dr	7
effective	7
else	7
environmental	7
epley	7
european	7
everything	7
experience	7
exposure	7
five	7
flu	7
gender	7
genes	7
governments	7
half	7
held	7
helps	7
hold	7
iv	7
juries	7
large	7
law	7
local	7
lower	7
management	7
marketing	7
marriage	7
matter	7
mentioned	7
normal	7
nothing	7
obamacare	7
pace	7
passage	7
passion	7
population	7
present	7
president	7
private	7
provide	7
psychological	7
question	7
radesky	7
range	7
recent	7
responsibility	7
rise	7
room	7
security	7
serious	7
single	7
stuck	7
successful	7
texts	7
th	7
threatened	7
title	7
wanted	7
workplace	7
worse	7
action	6
activities	6
advances	6
already	6
avoid	6
began	6
below	6
bmi	6
brain	6
bring	6
building	6
built	6
categories	6
certain	6
character	6
chicago	6
choices	6
classes	6
concern	6
concerns	6
conditions	6
continue	6
contrast	6
core	6
cost	6
country	6
crisis	6
critical	6
current	6
debt	6
decades	6
decision	6
decisions	6
degree	6
developing	6
difficult	6
divided	6
dna	6
dream	6
drive	6
during	6
eating	6
era	6
euro	6
evidence	6
expectations	6
experiment	6
fashion	6
fast-food	6
feeling	6
female	6
fill	6
finding	6
flatiron	6
flow	6
form	6
friends	6
full	6
general	6
gives	6
glass	6
goals	6
grants	6
habitat	6
hardly	6
house	6
husbands	6
iii	6
improve	6
increasingly	6
interest	6
internet	6
investment	6
isn	6
jurors	6
koziatek	6
l	6
landscape	6
late	6
leading	6
learning	6
level	6
london	6
m	6
major	6
managing	6
meet	6
meeting	6
moritz	6
mr	6
ms	6
needed	6
obese	6
offered	6
online	6
overweight	6
payments	6
physical	6
picture	6
plans	6
policies	6
prairie	6
project	6
promote	6
protect	6
quotas	6
r	6
reduce	6
reported	6
response	6
rest	6
result	6
rich	6
risk	6
sale	6
sales	6
save	6
schools	6
sense	6
shows	6
significant	6
situation	6
skills	6
snap	6
sometimes	6
special	6
spent	6
stock	6
struggle	6
stuff	6
suggest	6
supreme	6
systems	6
takes	6
talking	6
trade	6
trend	6
truly	6
understand	6
unless	6
view	6
virtue	6
went	6
whole	6
younger	6
ability	5
affordable	5
agencies	5
agency	5
along	5
appeal	5
areas	5
article	5
attractive	5
beauty	5
becoming	5
bio	5
bird	5
blame	5
businesses	5
buy	5
car	5
cases	5
challenging	5
changing	5
chicken	5
clean	5
clear	5
climate	5
company	5
confidence	5
constant	5
consumer	5
contemporary	5
control	5
corporations	5
creative	5
devices	5
disappointed	5
divorce	5
due	5
duty	5
ease	5
elite	5
employees	5
environment	5
essential	5
ever	5
executive	5
executives	5
experiments	5
experts	5
explore	5
factory	5
failing	5
favor	5
figure	5
finally	5
foreign	5
forever	5
forget	5
free	5
front	5
full-time	5
further	5
generation	5
gi	5
google	5
got	5
graduates	5
happen	5
happier	5
healthy	5
here	5
himself	5
houses	5
idea	5
identities	5
image	5
imagine	5
immigrants	5
immigration	5
including	5
increased	5
industries	5
infrastructure	5
invest	5
involuntary	5
involved	5
issue	5
issues	5
laws	5
legal	5
levels	5
li	5
lifestyle	5
love	5
mainly	5
middle-class	5
ming	5
minutes	5
modern	5
myriad	5
necessary	5
news	5
notes	5
numbers	5
offers	5
older	5
ones	5
optimistic	5
order	5
packed	5
parkrun	5
particular	5
pass	5
path	5
payment	5
perform	5
phone	5
phones	5
play	5
privacy	5
provided	5
quick	5
quite	5
rates	5
reaction	5
reads	5
reality	5
record	5
regular	5
regularly	5
reliable	5
require	5
requires	5
return	5
review	5
rights	5
rising	5
rule	5
rules	5
run	5
saying	5
scientists	5
screens	5
sector	5
seen	5
serve	5
sex	5
shift	5
shown	5
side	5
simmons	5
soldiers	5
solution	5
soon	5
stable	5
start	5
starting	5
strategies	5
studying	5
support	5
supposed	5
survey	5
teachers	5
team	5
tell	5
thriving	5
together	5
told	5
tough	5
tronick	5
trying	5
turn	5
understanding	5
unique	5
usfws	5
ve	5
western	5
willing	5
wrong	5
yourself	5
account	4
again	4
ahead	4
alone	4
andrew	4
anyone	4
appears	4
apply	4
appropriate	4
architecture	4
area	4
aren	4
ashe	4
attract	4
australia	4
authorities	4
automatic	4
automatically	4
babies	4
begin	4
behavioral	4
benefits	4
bill	4
billion	4
bit	4
blow	4
boost	4
brought	4
budget	4
build	4
carlyle	4
caused	4
causes	4
challenge	4
chances	4
chewing	4
chief	4
circumstances	4
city	4
closest	4
clothes	4
coding	4
colleges	4
colour	4
comes	4
coming	4
commission	4
completely	4
computers	4
contact	4
contribute	4
cortina	4
courses	4
currency	4
dangerous	4
decade	4
deeply	4
define	4
degrees	4
demand	4
depend	4
detailed	4
determine	4
diet	4
difference	4
dinner	4
director	4
disagree	4
discrimination	4
distractions	4
dollars	4
dominant	4
easier	4
effects	4
eliminate	4
email	4
emotions	4
employed	4
employee	4
employers	4
encouraged	4
ends	4
enormous	4
ensure	4
epidemic	4
eventually	4
examples	4
experiences	4
explain	4
express	4
faces	4
falling	4
families	4
faster	4
fat	4
fears	4
feels	4
fewer	4
financially	4
findings	4
fish	4
france	4
fulfillment	4
fun	4
fund	4
gained	4
germany	4
globalization	4
goal	4
gone	4
grades	4
graduating	4
group	4
h	4
hacker	4
hand	4
happens	4
head	4
historical	4
identify	4
importance	4
imposed	4
incentives	4
inevitable	4
inside	4
interested	4
introduce	4
invited	4
involve	4
isolated	4
japanese	4
jay	4
jobless	4
john	4
judging	4
landowners	4
largely	4
later	4
lean	4
leaving	4
lecture	4
lessons	4
let	4
limited	4
lines	4
linked	4
lists	4
logical	4
main	4
majority	4
mass	4
masses	4
meant	4
measured	4
media	4
medical	4
mental	4
millions	4
monitoring	4
months	4
mother	4
natural	4
neatly	4
newport	4
notice	4
olympic	4
open	4
opinion	4
opportunity	4
organization	4
ourselves	4
papers	4
participants	4
parts	4
passing	4
patterns	4
pens	4
planning	4
positions	4
possibility	4
potential	4
practical	4
practice	4
psychologist	4
purpose	4
pushed	4
race	4
raise	4
rapidly	4
recruiting	4
regard	4
related	4
relationship	4
renewable	4
representative	4
responses	4
revenues	4
sad	4
schneider	4
scientist	4
seldom	4
sell	4
setting	4
shared	4
shed	4
shedding	4
short	4
simple	4
skin	4
source	4
sources	4
speak	4
specific	4
stayed	4
stopped	4
story	4
struggling	4
supply	4
sure	4
surprise	4
surprising	4
table	4
taken	4
task	4
tech	4
term	4
therefore	4
thin	4
thomas	4
thousands	4
to-do	4
tolerant	4
tradition	4
treat	4
trial	4
turned	4
unemployment	4
unified	4
unpleasant	4
using	4
values	4
verbal	4
wait	4
watching	4
water	4
wealth	4
web	4
weight	4
whatever	4
whatsapp	4
white	4
whose	4
wife	4
win	4
wives	4
worked	4
worth	4
writes	4
wrote	4
york	4
absence	3
academically	3
academics	3
accelerate	3
accept	3
achieve	3
act	3
activity	3
advantage	3
affect	3
allow	3
allowed	3
amount	3
amounts	3
animals	3
announced	3
annual	3
anonymity	3
anwser	3
anxious	3
anymore	3
anything	3
apparently	3
appeals	3
appointed	3
approaches	3
architects	3
argues	3
artist	3
arts	3
artwork	3
aspects	3
assistance	3
assumed	3
attach	3
attractiveness	3
balanced	3
balch	3
battle	3
beautiful	3
behavior	3
behaviors	3
belief	3
believed	3
benefit	3
bids	3
biggest	3
biographies	3
bottles	3
brains	3
break	3
britain	3
burdens	3
bureaus	3
called	3
camp	3
capable	3
card	3
careers	3
cashless	3
catch	3
ceiling	3
chain	3
challenges	3
changed	3
changes	3
chemical	3
childhood	3
christie	3
closer	3
clothing	3
co	3
coach	3
colleagues	3
collectors	3
colours	3
comfortable	3
communicating	3
communities	3
commuters	3
compensation	3
composition	3
connection	3
conscious	3
construction	3
costs	3
cotton	3
courts	3
cover	3
crest	3
criticized	3
cross	3
crucial	3
cues	3
cultural	3
curtis	3
damage	3
davidson	3
debate	3
debates	3
deliver	3
demands	3
democratic	3
departure	3
depressed	3
depression	3
desirable	3
despite	3
developed	3
direct	3
directly	3
discover	3
disease	3
dishonest	3
district	3
double	3
dozen	3
driven	3
driver	3
driving	3
drop	3
dumn	3
earlier	3
earn	3
earnings	3
easily	3
eberle	3
effort	3
efforts	3
either	3
electric	3
electrical	3
elegance	3
elsewhere	3
emerged	3
empty	3
enjoy	3
enjoyable	3
entitled	3
equally	3
evening	3
events	3
everyday	3
exactly	3
excessive	3
exercise	3
expected	3
expressions	3
extremely	3
factories	3
fail	3
famous	3
fell	3
felt	3
field	3
fighting	3
figures	3
filled	3
film	3
flexibility	3
foods	3
fossil	3
freedom	3
french	3
friedman	3
fuels	3
fulfilling	3
fully	3
fundamental	3
gaining	3
games	3
gates	3
gave	3
genetic	3
german	3
glory	3
gottman	3
ground	3
growing	3
guy	3
habit	3
handling	3
hands	3
happened	3
hard-wired	3
harford	3
harmonization	3
harvard	3
height	3
high-school	3
highly	3
hirst	3
holds	3
household	3
housework	3
huge	3
humans	3
hurt	3
ideas	3
ideology	3
idleness	3
ignored	3
illegal	3
imagination	3
imitate	3
immediately	3
improving	3
include	3
income	3
increases	3
indifference	3
indifferent	3
inequality	3
inner	3
intended	3
interactions	3
interests	3
interference	3
interpersonal	3
interpreted	3
interviewed	3
introduced	3
involves	3
iowa	3
itself	3
journalists	3
judge	3
justice	3
khurana	3
kid	3
knowledge	3
known	3
koehn	3
labour	3
language	3
larger	3
lasting	3
lead	3
legacy	3
lengthy	3
lesser	3
long-term	3
looks	3
loss	3
lots	3
lunch	3
machines	3
maintain	3
makeup	3
managers	3
manufacturers	3
marked	3
massive	3
materials	3
meal	3
mean	3
measures	3
mechanical	3
memory	3
message	3
met	3
military	3
millennials	3
mind-set	3
minute	3
mixed	3
moderate	3
moisturizers	3
monthly	3
moral	3
mothers	3
motivated	3
motivation	3
multiple	3
n	3
nation	3
necessarily	3
neglected	3
ning	3
nor	3
norton	3
objective	3
observation	3
occasionally	3
offer	3
offering	3
officials	3
organizations	3
original	3
otherwise	3
overwhelmed	3
owners	3
paid	3
paragraphs	3
parent	3
parks	3
passed	3
patenting	3
paths	3
percentage	3
perception	3
petrarch	3
phrase	3
pieces	3
pillay	3
placing	3
position	3
powerful	3
powers	3
predict	3
prefer	3
preferences	3
prepared	3
preparing	3
presence	3
presentation	3
pretty	3
previous	3
price	3
prices	3
principles	3
procedures	3
process	3
produce	3
producing	3
productive	3
profit	3
profits	3
program	3
progress	3
promise	3
properly	3
prospect	3
prospects	3
prove	3
proved	3
providers	3
purchase	3
push	3
putting	3
pyle	3
quality	3
races	3
reach	3
react	3
reasons	3
recognition	3
records	3
registered	3
relatively	3
relieve	3
renewables	3
replace	3
replaced	3
reports	3
required	3
resist	3
resources	3
respects	3
restrict	3
retiring	3
reverse	3
revolution	3
risks	3
ritual	3
road	3
roads	3
roles	3
roughly	3
route	3
routine	3
sandberg	3
sat	3
scheduling	3
schooling	3
scientific	3
screeners	3
seek	3
seemed	3
selecting	3
self-enhancing	3
self-help	3
selling	3
senior	3
sentiment	3
served	3
severely	3
shelter	3
shoppers	3
shopping	3
silver	3
skill	3
smiles	3
solar	3
solve	3
somewhat	3
sort	3
species	3
square	3
standards	3
step	3
stimuli	3
strange	3
stranger	3
strangers	3
strengthen	3
stressed	3
strong	3
stronger	3
subheading	3
subheadings	3
suburbs	3
sufficient	3
supermarket	3
supportive	3
surprisingly	3
survival	3
swine	3
switch	3
switching	3
talked	3
teeth	3
temporarily	3
tendency	3
tension	3
thinks	3
thoughts	3
threats	3
took	3
towards	3
traditional	3
training	3
travel	3
tries	3
trust	3
turbines	3
turns	3
uncertain	3
unclear	3
underestimate	3
unemployed	3
unfortunately	3
unhealthy	3
union	3
unlikely	3
vaccine	3
various	3
virtually	3
visual	3
wants	3
weakness	3
weekly	3
wei	3
wellbeing	3
whom	3
widely	3
wildfires	3
wildlife	3
win-win	3
winners	3
wisdom	3
worker	3
worry	3
worsen	3
worst	3
worthy	3
y	3
yes	3
yield	3
zhang	3
zone	3
a-g	2
abolished	2
abroad	2
absorb	2
abstract	2
acceleration	2
accepted	2
acclimation	2
accomplish	2
accounts	2
acknowledge	2
acknowledging	2
acquire	2
acquired	2
activists	2
adds	2
adequately	2
administration	2
adult	2
advanced	2
advertised	2
advertisers	2
advised	2
advisers	2
affected	2
agents	2
agreement	2
aims	2
alert	2
alongside	2
amazon	2
ambitious	2
angry	2
antidiscrimination	2
ants	2
apartments	2
apologize	2
appear	2
appeared	2
application	2
appreciate	2
apps	2
arc	2
architectural	2
arguments	2
army	2
arrived	2
art-market	2
aside	2
asks	2
assess	2
assessment	2
assign	2
assistant	2
associate	2
association	2
associations	2
assume	2
atlantic	2
attempts	2
attend	2
attitudes	2
attracted	2
attraction	2
auction	2
auctioneer	2
auctions	2
authority	2
availability	2
bachelor	2
backfire	2
banks	2
banned	2
basic	2
basically	2
bauhaus	2
bed	2
beef	2
beginning	2
behaviour	2
beings	2
belong	2
benjamin	2
berning	2
bhugra	2
biased	2
biases	2
bigger	2
bike	2
bills	2
biologists	2
biotech	2
birgit	2
block	2
blog	2
blue	2
blurring	2
bn	2
boards	2
bodies	2
boring	2
born	2
borrow	2
bottled	2
bottom	2
bought	2
boy	2
boys	2
bread	2
breakfast	2
brief	2
bright	2
bringing	2
broke	2
broken	2
brushing	2
buildings	2
burst	2
calls	2
campaign	2
cap	2
capacity	2
capital	2
cards	2
care	2
carefully	2
cars	2
cartoon	2
caught	2
center	2
centers	2
centres	2
centuries	2
ceos	2
certainly	2
chance	2
characteristics	2
charitable	2
charity	2
check	2
checks	2
chemicals	2
childless	2
china	2
chose	2
christopher	2
cites	2
cities	2
citizens	2
claim	2
claiming	2
classical	2
classified	2
clearly	2
clicked	2
climb	2
clock	2
closely	2
co-ordination	2
coal	2
coalition	2
coax	2
code	2
colgate	2
collect	2
collection	2
columbia	2
combat	2
commented	2
commutes	2
compete	2
competing	2
competitive	2
complaint	2
complaints	2
completed	2
completeness	2
completing	2
complicated	2
concentrate	2
concentrated	2
confident	2
conflict	2
congratulate	2
congress	2
connected	2
consequence	2
consequences	2
conservation	2
consider	2
consideration	2
considering	2
considers	2
consumed	2
contain	2
content	2
contrary	2
contrasts	2
controlled	2
converge	2
conversational	2
conversations	2
conversely	2
convinced	2
cook	2
cooperation	2
cope	2
corner	2
correlation	2
corresponding	2
corresponds	2
councils	2
count	2
counterintuitive	2
counterproductive	2
couple	2
couples	2
covered	2
created	2
creation	2
cries	2
crises	2
criticism	2
crop	2
curriculum	2
customer	2
cut	2
damaske	2
damien	2
danaher	2
danger	2
daniel	2
database	2
date	2
deals	2
death	2
deaths	2
deborah	2
decided	2
declared	2
declining	2
decoration	2
decreased	2
defendants	2
delivering	2
delivery	2
democracy	2
denied	2
depending	2
der	2
described	2
devaluation	2
develop	2
developmental	2
developments	2
differences	2
differently	2
dilemma	2
dimmed	2
dinesh	2
direction	2
dirt	2
disadvantage	2
discovering	2
discusses	2
discussions	2
diseases	2
disintegration	2
dismissed	2
distant	2
districts	2
disturb	2
division	2
divorces	2
dog	2
domestic	2
doom	2
doors	2
doses	2
downtime	2
downturn	2
drawing	2
drinking	2
dropout	2
drug	2
dry	2
ds	2
dual	2
dunwell	2
eager	2
eat	2
ecology	2
economically	2
economies	2
ecosystem	2
electricity	2
element	2
embarrassed	2
embarrassment	2
emphasize	2
emphasized	2
encoded	2
encourage	2
enemies	2
energetic	2
engagement	2
engineering	2
engineers	2
enhances	2
entering	2
entertainment	2
enthusiasm	2
entire	2
environmentalists	2
epochal	2
equipment	2
equipped	2
equivalent	2
erased	2
establish	2
eurobonds	2
evolution	2
exception	2
exchange	2
exclusive	2
exhausted	2
existing	2
expect	2
expectation	2
expenditure	2
expensive	2
experienced	2
expert	2
explained	2
explains	2
explanation	2
expose	2
exposed	2
expression	2
extended	2
extent	2
eyes	2
fabric	2
facilities	2
facing	2
failure	2
fairly	2
faith	2
faithfulness	2
fall	2
fallen	2
familiar	2
fancy	2
fantasies	2
farm	2
fast	2
father	2
favourite	2
feelings	2
feet-than	2
fiction	2
fields	2
filed	2
final	2
finish	2
fire-prone	2
fires	2
fiscal	2
fit	2
fix	2
flat	2
flattering	2
float	2
foe	2
follow	2
followed	2
food-testing	2
football	2
forecast	2
forest	2
fortune	2
forward	2
foster	2
four-year	2
freedoms	2
frequent	2
frequently	2
freshmen	2
friend	2
friendly	2
frustration	2
fundamentally	2
funding	2
gains	2
galleries	2
gallup	2
gamble	2
game	2
gases	2
gdp	2
genders	2
generated	2
generations	2
generous	2
geometry	2
george	2
gets	2
gifts	2
girlhood	2
goes	2
goldman	2
good-paying	2
goods	2
granted	2
grassroots	2
grateful	2
gray	2
greatest	2
greatness	2
greenhouse	2
grocery	2
grow	2
grown	2
guaranteed	2
gum	2
hans	2
harm	2
harmful	2
hasn	2
havoc	2
headlong	2
healthier	2
hear	2
heart	2
heat	2
heavier	2
hello	2
helped	2
heroes	2
hi	2
hide	2
high-schoolers	2
high-speed	2
historian	2
historically	2
hit	2
hormones	2
hospitalizations	2
hospitals	2
hour	2
hsee	2
husband	2
hypotheses	2
ideal	2
ideals	2
identity	2
illness	2
illusions	2
illusory	2
imaginative	2
immediate	2
immersive	2
implied	2
importation	2
impose	2
impoverished	2
impressionists	2
impulsive	2
inclined	2
included	2
inclusive	2
incomes	2
independence	2
indicates	2
indispensable	2
individuals	2
industrialists	2
ineffective	2
infant	2
infants	2
infer	2
infinite	2
influenced	2
influences	2
inherent	2
inherently	2
initial	2
innocence	2
innocent	2
innovative	2
insecurities	2
insight	2
instance	2
instinctively	2
institute	2
intellectual	2
intensity	2
interacting	2
introductory	2
invested	2
investments	2
investors	2
irony	2
issued	2
items	2
japan	2
jason	2
jenny	2
join	2
joke	2
journey	2
joy	2
judgment	2
julie	2
june	2
keeping	2
kept	2
klohs	2
knew	2
knowing	2
lag	2
laid	2
lake	2
languages	2
large-scale	2
launched	2
lawyers	2
lazy	2
leaders	2
leadership	2
leads	2
leaves	2
legally	2
legislation	2
leisure	2
lessen	2
liberated	2
license	2
lifted	2
limit	2
lininger	2
linings	2
linking	2
links	2
listing	2
literary	2
loans	2
logo	2
longer-term	2
looked	2
losing	2
lottery	2
low	2
ludwig	2
lure	2
luxuries	2
magic	2
magnifying	2
majorities	2
male	2
manage	2
manageable	2
managed	2
march	2
markets	2
married	2
mastering	2
material	2
materialistic	2
matters	2
mcdonald	2
measure	2
medicaid	2
medication	2
member	2
memorable	2
memorization	2
meritocratic	2
methods	2
mexico	2
microsoft	2
mid	2
middle	2
middle-skill	2
mill	2
milliseconds	2
ministers	2
mislead	2
mistake	2
mobile	2
model	2
modest	2
momentum	2
monetary	2
month	2
mood	2
moola	2
moreover	2
morning	2
mortgage	2
mostly	2
mother-child	2
musical	2
mysterious	2
nancy	2
narrowed	2
navigate	2
necessities	2
neither	2
nevertheless	2
newsrooms	2
niccolo	2
nicholas	2
none	2
nonfiction	2
nonsense	2
nonverbal	2
notably	2
noticed	2
nowadays	2
obama	2
observed	2
observer	2
observers	2
obtain	2
obtained	2
obvious	2
obviously	2
october	2
odd	2
offices	2
official	2
officially	2
ohio	2
oliver	2
opened	2
opens	2
operations	2
oppressive	2
optimism	2
option	2
ordered	2
organize	2
oriented	2
origin	2
osborne	2
ought	2
outbreak	2
overall	2
overlook	2
overlooked	2
overly	2
overwhelming	2
overwhelmingly	2
p	2
painful	2
participate	2
partners	2
party	2
patented	2
patients	2
pattern	2
pave	2
peak	2
peers	2
perceive	2
perfect	2
perfected	2
performed	2
period	2
permanent	2
personalities	2
personally	2
persons	2
phenomenon	2
photographs	2
physiological	2
pioneering	2
playing	2
please	2
pleasure	2
pockets	2
pointed	2
pointless	2
politics	2
poll	2
pollutants	2
poorer	2
popularity	2
positively	2
postwar	2
precisely	2
predicted	2
prejudice	2
presently	2
prevalent	2
previously	2
primary	2
principal	2
prior	2
priorities	2
procter	2
producers	2
produces	2
production	2
professional	2
profiles	2
profound	2
programme	2
programming	2
proportion	2
proportions	2
proposal	2
proposed	2
prosperity	2
psychologists	2
purchases	2
pursuits	2
pushing	2
puts	2
qualifications	2
quantities	2
rainbow	2
random	2
rapid	2
rare	2
rarity	2
reactions	2
realised	2
realize	2
realms	2
recall	2
reckons	2
recognize	2
recommends	2
recovery	2
red	2
reducing	2
reference	2
refers	2
reflection	2
refuse	2
regions	2
regret	2
regulatory	2
reject	2
relates	2
relations	2
relaxation	2
released	2
relieved	2
reluctant	2
remove	2
rental	2
replacing	2
reply	2
representatives	2
represents	2
reputations	2
requirement	2
requirements	2
researcher	2
reshape	2
responsibilities	2
responsible	2
restore	2
restraint	2
returned	2
reveal	2
reward	2
rewarding	2
rewards	2
rhetoric	2
rigid	2
ritualistic	2
rob	2
rohe	2
roth	2
round	2
ruling	2
runners	2
safe	2
safer	2
satisfaction	2
satisfy	2
sauer	2
saved	2
scale	2
schmidt	2
schroeder	2
scornful	2
screen	2
second	2
seconds	2
seehorn	2
select	2
selected	2
self-enhancer	2
self-esteem	2
send	2
sensitive	2
september	2
settled	2
shape	2
sharing	2
shedder	2
sheryl	2
shifted	2
shock	2
shop	2
shore	2
shortage	2
shortages	2
shouldn	2
showed	2
sides	2
signed	2
silly	2
similar	2
simplified	2
simplify	2
situations	2
size	2
skepticism	2
skip	2
slice	2
sliced	2
slimmer	2
slow	2
smaller	2
smile	2
smith	2
snacks	2
so-called	2
soap	2
sociable	2
socially	2
soft	2
software	2
sold	2
soldier	2
sole	2
solutions	2
somewhere	2
sorrow	2
sotheby	2
southwestern	2
space	2
spaces	2
speech	2
speed	2
spirit	2
spohr	2
spokesperson	2
spread	2
st	2
stages	2
statements	2
steadily	2
stems	2
stenquist	2
stephenson	2
steps	2
stereotypes	2
stereotypical	2
stick	2
stiff	2
stood	2
storage	2
store	2
stored	2
stores	2
stricter	2
strikingly	2
student	2
style	2
styles	2
stylish	2
subjects	2
subsequent	2
subsidies	2
subtle	2
succeed	2
sudden	2
suggested	2
summarize	2
sums	2
superiority	2
supermarkets	2
surrounded	2
surveys	2
swept	2
sympathetic	2
syndrome	2
tactics	2
tag	2
talkative	2
talks	2
taught	2
tax	2
taylor	2
technician	2
techniques	2
technological	2
technologies	2
tended	2
tens	2
terminology	2
tested	2
textile	2
thanks	2
third	2
thorny	2
thrive	2
throughout	2
thus	2
tide	2
till	2
tim	2
time-management	2
tiny	2
tips	2
toddler	2
tony	2
tools	2
tougher	2
trading	2
tragedy	2
train	2
trained	2
transform	2
translated	2
trends	2
trick	2
trip	2
trips	2
troubled	2
trump	2
trusting	2
truths	2
tt	2
tv	2
twenty-seven	2
twice	2
twist	2
type	2
typical	2
typically	2
uk	2
unanswered	2
uncertainty	2
unconstitutional	2
undergraduates	2
underlined	2
unfashionable	2
unilever	2
universal	2
unnatural	2
unnecessary	2
unrealistic	2
unusual	2
upon	2
urged	2
urgency	2
urgent	2
uses	2
usual	2
utah	2
v	2
valuable	2
van	2
version	2
via	2
vice	2
victorian	2
victory	2
viewing	2
views	2
virginia	2
virtual	2
vision	2
visions	2
visit	2
vivid	2
vocabulary	2
vocational	2
volume	2
volunteer	2
volunteers	2
von	2
voting	2
wafwa	2
wage	2
wages	2
waiting	2
warning	2
washing	2
waste	2
wasteland	2
wear	2
weeks	2
welcome	2
whereas	2
whichever	2
wild	2
woman	2
wore	2
workforce	2
working-class	2
wortmann	2
wouldn	2
wreaking	2
written	2
x	2
z	2
a-f	1
abandon	1
abbreviation	1
abcs	1
absolute	1
absolutely	1
absorbed	1
absorbs	1
absurd	1
abundance	1
abundant	1
abuse	1
abuses	1
accelerating	1
accommodating	1
accompany	1
accomplished	1
accomplishing	1
accounted	1
accounting	1
accumulate	1
accuracy	1
accurately	1
accustomed	1
acdording	1
achievements	1
achieving	1
acknowledged	1
aconfusing	1
acquaintances	1
acre	1
acreage	1
acres	1
across-the-board	1
activated	1
active	1
actively	1
actor	1
actual	1
acture	1
acute	1
adam	1
adapt	1
adaptation	1
add	1
addicting	1
adding	1
addressed	1
addresses	1
addressing	1
adequate	1
adjust	1
adjusting	1
adjustments	1
administrators	1
admire	1
admired	1
admitted	1
admitting	1
adolescent	1
adopt	1
adopted	1
ads	1
advancea	1
advantages	1
adventurism	1
advertisement	1
aesthetic	1
affecting	1
affectionate	1
afford	1
afforded	1
affords	1
afloat	1
afraid	1
aftermath	1
afterwards	1
aggressively	1
agitated	1
aglass	1
agonies	1
agonizing	1
agreed	1
aides	1
aim	1
aimed	1
air	1
air-conditioned	1
airlines	1
airy	1
ajob	1
alarmed	1
alawyer	1
alcohol	1
alike	1
alive	1
allegiance	1
alleviating	1
alleviation	1
allocate	1
alter	1
altered	1
alternative	1
am	1
amazing	1
ambiguous	1
ambition	1
amid	1
amplifying	1
analogy	1
analyses	1
analysis	1
analyzed	1
analyzes	1
and-mud	1
anecdotes	1
angeles	1
anger	1
anobel	1
ansere	1
anti-immigrant	1
anti-obesity	1
anticipate	1
antiperspirants	1
anxiety	1
anybody	1
apacity	1
apainful	1
apart	1
apartment	1
aphids	1
apology	1
apopular	1
apparent	1
appearance	1
appearing	1
appers	1
appetite	1
applaud	1
applicable	1
applicants	1
applications	1
applied	1
applying	1
appointment	1
appreciation	1
appropriately	1
approval	1
april	1
arbutus	1
architect	1
aregenerally	1
argue	1
argued	1
arguing	1
arkwright	1
aroud	1
arrangements	1
array	1
arrival	1
arrives	1
arrogance	1
art-and	1
art-buying	1
articles	1
artists	1
asking	1
assemble	1
assembling	1
assets	1
assigned	1
assigning	1
assignment	1
assignments	1
associative	1
assured	1
astonishing	1
astronaut	1
athletes	1
athletic	1
attempt	1
attentive	1
attracting	1
attribute	1
attributes	1
authenticate	1
authenticated	1
authoritative	1
auto	1
automated	1
automation	1
avenues	1
avoided	1
avoiding	1
awaiting	1
aware	1
awful	1
awkward	1
awoken	1
baby	1
bacheloi	1
backdrop	1
backgrounds	1
bacon	1
baddeley	1
baesd	1
bail-out	1
balances	1
ban	1
bandaid	1
bandwidth	1
bang	1
bank	1
bankruptcy	1
barely	1
bargain	1
barked	1
barriers	1
baseless	1
batteries	1
battery	1
battery-powered	1
battles	1
beacons	1
beaten	1
begun	1
behaviours	1
being-human	1
beliefs	1
believing	1
belongs	1
belt	1
ben	1
ben-shalar	1
bend	1
beneath	1
beneficial	1
benign	1
bermuda	1
beside	1
betft	1
betrayed	1
bets	1
better-trained	1
beverage	1
bewilderingly	1
biases-or	1
bicycle	1
bidders	1
billions	1
binding	1
biographical	1
biologist	1
biotechnology	1
bite-sized	1
black	1
blamed	1
blanket	1
bleed-over	1
blessing	1
blogging	1
blood	1
blue-ribbon	1
blunders	1
blunt	1
boasting	1
boil	1
boldness	1
bonaparte	1
bones	1
bonus	1
boom	1
boomers	1
boon	1
boosted	1
bootcamps	1
booth	1
borders	1
bore	1
borrowed	1
borrowing	1
boston	1
bothered	1
bottling	1
boulder	1
boundaries	1
bourgeois	1
brain-scan	1
brand	1
brands	1
brazilian	1
break-up	1
breaking	1
breaks	1
breast	1
breath	1
breathing	1
briefly	1
brightest	1
brim	1
brings	1
britian	1
broadband	1
broader	1
broadly	1
broadway	1
brokan	1
brothers	1
brown	1
brushed	1
brutal	1
buck	1
bugs	1
bull	1
bullet	1
bur	1
burden	1
burned	1
businessmen	1
businssesto	1
butchers	1
butnot	1
buyers	1
buys	1
buzzword	1
bygovernments	1
cab	1
cal	1
calcium	1
calendar	1
california	1
cam	1
campaigns	1
campus	1
canada	1
canbe	1
cancel	1
cancer	1
candies	1
canny	1
capitalism	1
capture	1
captured	1
carcasses	1
carefree	1
caregivers	1
careless	1
caring	1
carnegie	1
carol	1
carolina	1
carpet	1
carries	1
carrot	1
carrying	1
cart	1
cartoons	1
cased	1
cashed	1
catalina	1
catalogue	1
catch-up-with-household	1
catherine	1
cause	1
causing	1
caution	1
cautious	1
cavity-preventing	1
celebrate	1
celebrated	1
certainty	1
chained	1
chains	1
chalkboard	1
championed	1
chan	1
chancellor	1
changeable	1
changed-new	1
chaotic	1
characterized	1
charged	1
cheaper	1
cheaply	1
checked	1
cheerleaders	1
chickens	1
childcare	1
children-move	1
chile	1
chiller	1
chip	1
chooses	1
chosen	1
chosing	1
christmas	1
christmases	1
chronic	1
chronicle	1
chronicles	1
chronicling	1
chuang	1
chunk	1
chunks	1
cigarette-style	1
cinema	1
circle	1
circuits	1
circulation	1
cite	1
cited	1
citizen	1
civilians	1
civilization	1
civilized	1
claimed	1
claims	1
clapped	1
clare	1
clarity	1
class-action	1
classification	1
classify	1
classmates	1
cleaning	1
cleanser	1
clear-cut	1
clearer	1
clever	1
clich	1
clicit	1
clients	1
clinic	1
clinically	1
club	1
clubs	1
clues	1
clumsy	1
co-author	1
co-workers	1
coaches	1
coaching	1
coast	1
coders	1
codified	1
coffee	1
cofounded	1
coil	1
coils	1
coincided	1
coincidence	1
cold	1
colgate-palmolive	1
collaborations	1
colleague	1
collegiate	1
colognes	1
colony	1
colorado	1
colour-coded	1
combination	1
combined	1
comelations	1
commemorated	1
comment	1
commercial	1
commercially	1
commercials	1
commissioned	1
commitment	1
committee	1
committing	1
commodities	1
commonly	1
communicate	1
communications	1
communist	1
community-college	1
commute	1
commuted	1
companionship	1
comparable	1
compare	1
compel	1
compensate	1
competent	1
competitiveness	1
competitor	1
complain	1
complained	1
complaining	1
complex	1
complexity	1
compliment	1
comprehensive	1
compress	1
compromise	1
compromises	1
computer-science	1
conceal	1
conceited	1
concentration	1
conceptual	1
concluded	1
conclusion	1
concrete	1
condemn	1
condition	1
conduced	1
conducts	1
conflicted	1
conflicting	1
conflicts	1
conform	1
confrontational	1
confused	1
confusing	1
conjunction	1
connecting	1
connections	1
conquering	1
conscience	1
conservations	1
conservative	1
constancy	1
constantly	1
constitutes	1
consultant	1
consumerism	1
consumption	1
contains	1
contemplating	1
contest	1
context	1
contexts	1
continent	1
continued	1
continuous	1
contraction	1
contradicted	1
contradicting	1
contradictory	1
contributing	1
contribution	1
contributor	1
controversies	1
controversy	1
convened	1
convenient	1
convention	1
conventional	1
conventiongs	1
convert	1
conveyor	1
cooked	1
cooking	1
copper	1
copy	1
corporate-governance	1
corporate-tax	1
correct	1
corrected	1
correlated	1
correlations	1
corresponded	1
correspondent	1
cortisol	1
costless	1
costly	1
couch	1
couches	1
couldn	1
council	1
counselled	1
counter	1
counteracted	1
counterbalance	1
counterparts	1
counters	1
counting	1
counts	1
cousin	1
covering	1
cozier	1
crack	1
craft	1
crash	1
craze	1
cream	1
creams	1
credential	1
credit	1
credits	1
creeps	1
crisps	1
critic	1
critics	1
cromwell	1
cross-generation	1
crystallizes	1
cultivated	1
cunning	1
curbing	1
curious	1
curo-zone	1
currently	1
cute	1
cybercrime	1
cyberczar	1
damaged	1
dancing	1
dangers	1
day-by-day	1
day-in	1
de	1
dealers	1
dealt	1
dean	1
dearest	1
decades-by	1
decay	1
decaying	1
decent	1
decide	1
decision-making	1
decrease	1
dedicated	1
deep-seated	1
deeper	1
deerfulness	1
default	1
defendable	1
defending	1
defense	1
defensive	1
deficiency	1
defines	1
defining	1
definitely	1
definitions	1
degrading	1
delayed	1
deliberation	1
delight	1
delis	1
delivered	1
delusion	1
demise	1
demotivated	1
denies	1
deny	1
denying	1
departed	1
departing	1
dependent	1
depends	1
depicted	1
deployed	1
depressing	1
depressions	1
depriving	1
derive	1
describe	1
description	1
deserves	1
designate	1
designated	1
designers	1
designing	1
desire	1
desired	1
desk	1
despaired	1
despised	1
destroyed	1
destructive	1
detail	1
detailing	1
detect	1
detected	1
determined	1
determines	1
deuwell	1
devalue	1
devaluing	1
devastating	1
device	1
devised	1
devote	1
di	1
diagnosing	1
diagnosis	1
diaries	1
dictate	1
dictated	1
dictionary	1
didin	1
died	1
different-sized	1
differentiates	1
differs	1
difficulties	1
difficulty	1
digialproducts	1
digitalized	1
digits	1
diligence	1
dip	1
directed	1
dirt-snow	1
dirty	1
disadvantaged	1
disadvantages	1
disappear	1
disappearance	1
disappearances	1
disappeared	1
disappearing	1
disaster	1
disastrous	1
discarded	1
discerning	1
discipline	1
disconcerting	1
disconnected	1
discourage	1
discuss	1
discussing	1
disengage	1
disgrace	1
disguised	1
disgusting	1
disinfecting	1
dismiss	1
disorder	1
displayed	1
disputed	1
disputes	1
disruptive	1
distinction	1
distinctive	1
distinctiveness	1
distinguished	1
distracted	1
distraction	1
distracts	1
distressed	1
distributed	1
disturbed	1
dits	1
diversiy	1
divide	1
divides	1
do-rough	1
doctor	1
doctored	1
doctors	1
documents	1
does-or	1
doge	1
dolman	1
domain	1
dominate	1
domino	1
donald	1
door	1
dot	1
dot-com	1
doubled	1
doubtful	1
downsides	1
downstairs	1
downward	1
drain	1
dramatic	1
dramatically	1
drastic	1
drastically	1
draw	1
draws	1
dresses	1
drink	1
drinks	1
drivers	1
drives	1
dropped	1
dropping	1
drove	1
drugs	1
dryers	1
dt	1
ducational	1
dullness	1
duplicated	1
duties	1
e-readers	1
earliest	1
earning	1
earth	1
easiest	1
eaters	1
echo	1
eco-friendly	1
economical	1
economics	1
economist	1
ed	1
edges	1
editors	1
educated	1
edward	1
effectively	1
efficacy	1
egos	1
egypt	1
eight	1
elderly	1
elders	1
electing	1
electrified	1
electronically	1
elegant	1
eligible	1
eliminated	1
eliminating	1
elitism	1
elizabeth	1
emails	1
emailto	1
embrace	1
emergency	1
emigrants	1
emigrate	1
emigrated	1
emissions	1
emit	1
emotion	1
emotionally	1
empathy	1
empirical	1
employ	1
empowering	1
emptiness	1
enable	1
encouragement	1
encouraging	1
encyclopedias	1
endangered	1
endeavor	1
ended	1
ending	1
endless	1
endlessly	1
endorphins	1
endured	1
enfection	1
engels	1
engine	1
engineer	1
england	1
enhance	1
eninglish	1
enormously	1
enrich	1
enrolled	1
ensured	1
ensures	1
ensuring	1
enter	1
entirely	1
entrepreneurs	1
environmentwould	1
ep	1
episode	1
epoch	1
equal	1
equality	1
equals	1
equation	1
eric	1
ernie	1
eroticism	1
errands	1
erupted	1
essence	1
essentially	1
established	1
establishing	1
estate	1
esteem	1
estimate	1
estimated	1
ethical	1
ethos	1
euro-zone	1
evade	1
evading	1
evaluation	1
evaporated	1
evenly	1
event	1
ever-tinier	1
evervthing	1
everybody	1
evils	1
evolved	1
exact	1
exaggerating	1
exanmle	1
excel	1
except	1
exchanges	1
exchequer	1
excited	1
exciting	1
exclude	1
execution	1
exemplary	1
exempted	1
exercisers	1
exert	1
exerting	1
exhaustion	1
exhibit	1
exist	1
existsthe	1
expaains	1
expense	1
experiencing	1
expire	1
explaining	1
explicitly	1
exploitation	1
explorers	1
explores	1
explosion	1
expressed	1
exquisitely	1
extend	1
extensive	1
extensively	1
external	1
extinction	1
extra-their	1
extravagant	1
extreme	1
faccbook	1
faced	1
facilitice	1
factor	1
fade	1
failures	1
fairer	1
fairy	1
faithful	1
falls	1
falsely	1
famed	1
family-friendly	1
family-owned	1
fantasized	1
far-off	1
faris	1
farsighted	1
fascinating	1
fast-food-free	1
fast-moving	1
fathers	1
faulty	1
favorite	1
favorites	1
favors	1
favour	1
feasible	1
feature	1
featured	1
february	1
federation	1
feed	1
feedback	1
feelsdown-sag	1
fellow	1
femininity	1
festival	1
fetching	1
fever	1
fiancial	1
fibres	1
fiddle	1
fielding	1
fiercest	1
fifth	1
fight	1
figuring	1
file	1
finance	1
finds	1
finely	1
fingernails	1
fingerprint	1
finishing	1
fire-fighting	1
fired	1
firmly	1
first-timer	1
first-timers	1
first-year	1
fish-sellers	1
fitness	1
fits	1
fitter	1
fiver	1
fixeed	1
flashes	1
fled	1
flight	1
florida	1
flowing	1
fluctuant	1
fluctuation	1
flumist	1
flustered	1
flywheel	1
focuses	1
folks	1
foodie	1
foodies	1
forced	1
forcing	1
forecasters	1
forefathers	1
foregin	1
foreigners	1
foremost	1
forging	1
forgive	1
forgotten	1
formally	1
formed	1
formulate	1
formulation	1
forth	1
forthcoming	1
forthe	1
forthright	1
fortunate	1
forward-thinking	1
founded	1
founder	1
fount	1
fourth	1
fox	1
foxholes	1
fragments	1
frame	1
franca	1
francisco	1
frank	1
fraud	1
free-market	1
freeze	1
freezer	1
frequency	1
frequestly	1
freshener	1
fresheners	1
friendship	1
friendships	1
frighten	1
frozen	1
frugal	1
fruitful	1
fruition	1
fruits	1
frustrated	1
ft	1
fucus	1
fuel	1
fulfill	1
function	1
functions	1
fundcleanerenergy	1
funny	1
furnish	1
furthermore	1
fuses	1
gain	1
galway	1
garden	1
gary	1
gas	1
gather	1
gathering	1
gear	1
gender-equality	1
gender-neutral	1
generate	1
generates	1
generating	1
generational	1
genetics	1
geneva	1
genius	1
genome	1
genss	1
genuinely	1
gestured	1
giggling	1
give-in	1
glares	1
glasses	1
globally	1
gloria	1
goal-focused	1
goallessness	1
gold	1
gotten	1
govemment	1
govern	1
governance	1
governing	1
governmental	1
governmentmay	1
grade	1
grader	1
gradually	1
graduate	1
graduated	1
graffitied	1
grams	1
grand	1
grandfather	1
grandparents	1
grant	1
grappling	1
grassland	1
grasslands	1
greatly	1
greed	1
green	1
greengrocer	1
greeted	1
grew	1
grieving	1
grounded	1
grownups	1
guarantee	1
guarantees	1
guard	1
guide	1
guided	1
guideline	1
guilt	1
gums	1
gun	1
habitual	1
habitually	1
hail	1
hair	1
halved	1
ham	1
hamopened	1
hampshire	1
handed	1
handy	1
happiest	1
happymoney	1
harbor	1
hardship	1
harm-doers	1
harmed	1
harmonies	1
hat	1
hate-whatever	1
haven	1
headed	1
heading	1
headings	1
headlines	1
headquartered	1
heads	1
health-care	1
hearings	1
hearts	1
heaven	1
heightened	1
helicopters	1
helpful	1
helping	1
helpless	1
hence	1
hero	1
heroic	1
hey	1
hidden	1
high-risk	1
high-skill	1
high-skilled	1
high-tech	1
high-visibility	1
highest	1
highlighted	1
highlighting	1
hill	1
hinder	1
hinted	1
hints	1
hire	1
hiring	1
historic	1
hobby	1
hobsbawm	1
holb	1
holiday	1
homebuyers	1
homegrown	1
honest	1
honestly	1
honeydew	1
honorably	1
hopeful	1
hopeless	1
hopes	1
hospital	1
hospitals-areas	1
hosptibal	1
host	1
hot	1
households	1
houses-usually	1
housewives	1
howard	1
hugely	1
humor	1
hundreds	1
hunger	1
hurdle	1
hurts	1
id	1
idealized	1
identified	1
identifying	1
ignore	1
iiitranslation	1
ill	1
illiterate	1
ills	1
illustrate	1
illustrates	1
illustribus	1
images	1
imagined	1
imagining	1
imbalancens	1
imbalances	1
imitated	1
immense	1
immerse	1
immigrant	1
immigrantion	1
immigrate	1
immune	1
imparted	1
impatience	1
implement	1
implication	1
implies	1
imply	1
implying	1
imposes	1
impossibilities	1
impractical	1
impression	1
improved	1
improvements	1
improvisation	1
impulses	1
inadequacy	1
inadequate	1
inappropriate	1
inborn	1
incapable	1
incidentally	1
incidents	1
inclination	1
includes	1
inclued	1
increasing	1
increasinglythestoryisabout	1
incurred	1
independent	1
index	1
indian	1
indians	1
indicate	1
indications	1
indicator	1
indicators	1
indivi	1
individualism	1
induce	1
inducements	1
indulge	1
indulgence	1
inefficiency	1
inequalities	1
inequities	1
inexperienced	1
infected	1
inferiority	1
inflexible	1
infocused	1
inform	1
infuse	1
ingrained	1
ingredients	1
inhabit	1
initially	1
initiative	1
initiatives	1
injected	1
innovatiaon	1
innovation	1
inopportune	1
inquiry	1
insects	1
insensitive	1
insidious	1
insistence	1
insists	1
inspiration	1
inspire	1
inspired	1
instability	1
instantly	1
instinct	1
instituted	1
institutions	1
instructor	1
instrumentally	1
intcract	1
integrity	1
intellect	1
intelligence	1
intends	1
intention	1
intentional	1
interact	1
interaction	1
interesting	1
interim	1
intermittently	1
internal	1
international	1
interpretation	1
interrelations	1
interrupt	1
interrupted	1
interruption	1
interruptions	1
intervening	1
intervention	1
intimations	1
intimidating	1
intricate	1
intrinsically	1
introduction	1
intuitive	1
intuitively	1
invading	1
invent	1
invented	1
investigating	1
investing	1
investor	1
invisible	1
invitation	1
invites	1
involving	1
ireland	1
irrational	1
island	1
isperspective	1
isreconstruction	1
issuer	1
issuing	1
italian	1
italy	1
itclear	1
item	1
ivwriting	1
jack	1
jackpot	1
james	1
jamie	1
january	1
jo	1
joblessness	1
jobs-about	1
joined	1
jollier	1
jolt	1
jolts	1
jon	1
josiah	1
journal	1
journalism	1
journalist	1
journalistic	1
judged	1
judges	1
juiced	1
juliana	1
july	1
jump	1
jumping	1
jumps	1
juniors	1
jure	1
jurisdictions	1
justices	1
justification	1
justified	1
justify	1
k	1
kastl	1
keen	1
keeps	1
kick	1
kicking	1
kill	1
killers	1
kinds	1
kins	1
km	1
knows	1
knuckles	1
kohler	1
korean	1
label	1
laboratory	1
lacking	1
ladder	1
lags	1
laminated	1
landmark	1
landowner	1
landscapes	1
lansley	1
largest	1
lasts	1
latest	1
laugh	1
laughing	1
laughter	1
lawless	1
lawsuit	1
lawsuits	1
lay-off	1
laziness	1
leak	1
leaning	1
lectronic	1
lecture-he	1
lecturer	1
lecturing	1
leftovers	1
lehman	1
length	1
lens	1
lent	1
less-experienced	1
less-misses	1
lets	1
letters	1
liasy	1
liberal	1
liberalism	1
liberate	1
licensed	1
life-hack	1
life-support	1
life-sustaining	1
lifestyles	1
likelihood	1
likes	1
likewise	1
limitations	1
lineup	1
linger	1
lingua	1
linguists	1
lining	1
listen	1
literacy	1
lived	1
lloyd	1
llustrate	1
loaded	1
located	1
log	1
logic	1
logically	1
longest	1
loosened	1
los	1
lose	1
losses	1
lotions	1
lotteries	1
loud	1
louisiana	1
lovers	1
loves	1
lower-hazard	1
lowered	1
loyalty	1
lucrative	1
lunches	1
luring	1
luther	1
luxuriant	1
luxury	1
ma	1
macdonald	1
machiavelli	1
machiavellli	1
machine	1
mackenzie	1
macrib	1
made-in-mexico	1
madison	1
magazine	1
magnificent	1
magnify	1
magrac	1
majors	1
maker	1
makers	1
male-dominated	1
man-made	1
manchester	1
mandate	1
mandates	1
mandating	1
mandatory	1
manifest	1
manifesto	1
manipulation	1
manufacrurers	1
manufacture	1
manufactured	1
map	1
margaret	1
margins	1
marker	1
marketers	1
marketplace	1
martin	1
marx	1
mary	1
masculine	1
masked	1
masterpieces	1
match	1
matched	1
mature	1
maulden	1
max	1
maximal	1
maximised	1
maximize	1
mayo	1
mcandrew	1
mcdonalds	1
mcrib	1
meals	1
mealtimes	1
mean-spirited	1
meaningful	1
meaningto	1
meantime	1
measurement	1
meat	1
mechanism	1
mechanisms	1
medicine	1
mega-projects	1
mellon	1
membership	1
memories	1
memories-particularly	1
mental-health	1
mentality	1
mentions	1
menu	1
mercy	1
mere	1
merely	1
meritocracy	1
mess	1
messages	1
messaging	1
messy	1
metal	1
metaphor	1
methodically	1
mexican	1
michael	1
michelin-starred	1
michelle	1
michigan	1
mid-skill	1
middle-aged	1
midwestern	1
mighty	1
migration	1
mild	1
miles	1
milestones	1
millin	1
mills	1
mindless	1
mindset	1
mine	1
minimal	1
minister	1
ministerial	1
minnesota	1
misadjusted	1
misapplied	1
misconceptions	1
miserable	1
misguide	1
misinterpreted	1
misleading	1
mismatched	1
misplaced	1
miss	1
missed	1
mission	1
misunderstand	1
mitigating	1
mix	1
mock	1
moderately	1
modernism	1
modernized	1
modifies	1
molecule	1
molecules-most	1
moments	1
momentumaround	1
mommies	1
mommy	1
monday	1
monitor	1
